export default function About() {
  const data = [
    {
      title: 'טכנולוגיה',
      description: `אנו פועלים באמצעות טכנולוגיות סריקה מתקדמות שפיתחנו במיוחד, המאפשרות להאיץ תהליכים, לשפר
            את היעילות בעבודה, ולצמצם טעויות אנוש. המערכות שלנו מתוכננות בצורה מדויקת כך שיתאימו באופן
            אופטימלי לצורכי הלקוחות השונים, תוך התחשבות במאפיינים הייחודיים של כל פרויקט. המטרה היא
            לספק ביצועים ברמה הגבוהה ביותר, המותאמים לכל לקוח באופן אישי, על מנת להבטיח מענה מלא
            לצרכים שלהם ושיפור מתמיד בתהליכי העבודה`,
    },
    {
      title: 'החזון שלנו',
      description: `כחברה, המטרה המרכזית שלנו היא לייעל עבורכם, הלקוחות, את זמני הביצוע בפרויקטים שלכם. המערכת
            שפיתחנו מאפשרת לנו לעמוד ביעדים שהצבנו ולהמשיך לשפר באופן מתמיד את רמת האיכות והשירות.
            בנוסף, אנו מחויבים לספק פתרונות חדשניים ומתקדמים לניהול פרויקטים, שמטרתם לשפר את תהליכי
            העבודה ולהביא לתוצאות מיטביות`,
    },
    {
      title: 'פרופיל החברה',
      description: `אנו מתמחים בפיתוח מערכות מתקדמות לניהול, מעקב ופיקוח על פרויקטים בתחום הבנייה והתשתיות.
            החברה מספקת פתרונות חדשניים לניהול התקנות, פיקוח על קבלני משנה, ניהול לוחות זמנים וחישובי
            תשלומים בצורה יעילה ושקופה. המערכות שלנו מבוססות על טכנולוגיות סריקה ואוטומציה מתקדמות,
            כולל שעוני נוכחות מובנים, ומאפשרות לכל בעלי התפקידים לעקוב בזמן אמת אחר התקדמות הפרויקט.
            אנו מחויבים לספק ללקוחותינו כלים לחיסכון בזמן ובעלויות, לשיפור הביצועים ולמניעת סכסוכים,
            עם פתרונות מותאמים אישית לצורכי הפרויקט`,
    },
  ]

  return (
    <div
      className="grid md:grid-cols-3 gap-20 py-20 bg-img"
      style={{ backgroundImage: `url(${src})` }}>
      {data.map((item) => (
        <section
          key={item.title}
          className="backdrop-blur-lg	 p-10 rounded-xl shadow-xl bg-gradient-to-br from-white/60  to-blue-100/50">
          <h3 className="text-600 mb-4">{item.title}</h3>
          <p>{item.description}</p>
        </section>
      ))}
    </div>
  )
}

const src = 'https://images.unsplash.com/photo-1481026469463-66327c86e544?w=1000'
