import Icon from 'zvijude/icon'

export default function FeatureTabs() {
  const data = [
    {
      title: 'אוטומציה',
      description:
        'אוטומציה של משימות במערכת  מאפשרת ייעול משמעותי של תהליכי העבודה. המערכת מתזמנת ומנהלת משימות בצורה אוטומטית, משגרת תזכורות והתראות בהתאם לשלבי הפרויקט, ומבצעת מעקב אחר הביצועים בזמן אמת. כך, כל משימה מוקצית ונעקבת באופן אוטומטי, מבלי צורך במעקב ידני, מה שמפחית טעויות, חוסך זמן יקר ומשפר את התיאום בין כל המשתמשים בפרויקט',
      img: 'https://images.unsplash.com/photo-1429497419816-9ca5cfb4571a?w=1000',
    },
    {
      title: 'מעקב מדויק',
      description:
        'המערכת  מאפשרת מעקב מדויק אחר כל שלב בתהליך ההתקנה, מהתחלה ועד לסיום. בעזרת ברקודים ייחודיים לכל פריט ומשימה, תוכלו לצפות בזמן אמת בהתקדמות ההתקנות, לדעת איזה שלב הושלם ומה עדיין נותר לביצוע. המערכת מספקת לכם שקיפות מלאה ומבטיחה שכל פריט בפרויקט מנוהל ומפוקח בצורה יעילה, כך שתמיד תהיו מעודכנים בכל רגע על מצב ההתקנה בשטח',
      img: 'https://images.unsplash.com/photo-1693639385915-d7a7ddefe8e1?w=1000',
    },
    {
      title: 'ניהול ואישור התקנות',
      description:
        'המערכת  לניהול ופיקוח קבלני משנה מספקת פתרון יעיל לשליטה ובקרה על כל הפעילות של קבלני המשנה בפרויקט. המערכת מאפשרת להקצות משימות לקבלני משנה, לעקוב אחר ביצוען בזמן אמת, ולוודא שהן מבוצעות בהתאם ללוח הזמנים והדרישות שהוגדרו. בנוסף, תוכלו לעקוב אחר נוכחות קבלני המשנה, לדווח על ביצועים, ולבצע חישובים אוטומטיים לתשלום בהתאם לכמות הביצועים. המערכת גם מאפשרת ניהול שקוף של התקשורת והעבודה עם קבלני המשנה, ובכך מונעת עיכובים וסכסוכים ומבטיחה עבודה חלקה ויעילה',
      img: 'https://images.unsplash.com/photo-1638519922476-50688bb1f318?w=1000',
    },
  ] as any[]

  return (
    <div className="py-20">
      <h2 className="text-3xl my-12">מערכת לניהול פרויקטים עד לפרט הכי קטן</h2>
      {data.map((item) => (
        <section key={item.title} className="relative mb-20 py-10 px-12 rounded-xl ">
          <div className="max-w-xl z-10 relative bg-white/80 p-10 rounded-xl shadow-xl backdrop-blur-xl">
            <h3 className="text-800 mb-8">{item.title}</h3>
            <p>{item.description}</p>
          </div>
          <img
            src={item.img}
            alt=""
            className="mask-r w-full rounded-lg absolute top-0 left-0  size-full"
            loading="lazy"
          />
        </section>
      ))}
    </div>
  )
}
